package com.jaiz.dailyreport.config;

/**
 * 默认模板
 */
public class Templates {

    /**
     * 默认日报模板
     */
    public static final String DEFAULT_REPORT_TEMPLATE =
            "收件人：\n" +
                    "${email.recievers}\n" +
                    "\n" +
                    "抄送：\n" +
                    "${email.cc.recievers}\n" +
                    "\n" +
                    "主题：\n" +
                    "${department.name}日报 - ${report.date} - ${reporter.name}\n" +
                    "\n" +
                    "内容：\n" +
                    "\n" +
                    "${department.name}日报 - ${report.date} - ${reporter.name}\n" +
                    "----------------------------------------------------------------------------------------------------------------------\n" +
                    "当天工作成果\n" +
                    "${today.achievements}\n" +
                    "----------------------------------------------------------------------------------------------------------------------\n" +
                    "碰到问题&解决方案\n" +
                    "${problems.solutions}\n" +
                    "----------------------------------------------------------------------------------------------------------------------\n" +
                    "明天工作计划\n" +
                    "${tomorrow.targets}\n";

    /**
     * 默认codeReview模板
     */
    public static final String DEFAULT_CODE_REVIEW_TEMPLATE =
            "\n" +
                    "\n" +
                    "review报告：\n" +
                    "-------------------------------------------------------------------------------------------\n" +
                    "日期：周二${date01}\n" +
                    "项目：${date01.projects}\n" +
                    "未发现问题/未找到code review\n" +
                    "------------------------------------------------------------------------------------------\n" +
                    "日期：周三${date02}\n" +
                    "项目：${date02.projects}\n" +
                    "未发现问题/未找到code review\n" +
                    "------------------------------------------------------------------------------------------\n" +
                    "日期：周四${date03}\n" +
                    "项目：${date03.projects}\n" +
                    "未发现问题/未找到code review\n" +
                    "------------------------------------------------------------------------------------------\n" +
                    "日期：周五${date04}\n" +
                    "项目：${date04.projects}\n" +
                    "未发现问题/未找到code review\n" +
                    "------------------------------------------------------------------------------------------\n" +
                    "日期：周一${date05}\n" +
                    "项目：${date05.projects}\n" +
                    "未发现问题/未找到code review\n" +
                    "\n" +
                    "=============================================\n" +
                    "\n" +
                    "fix review报告：\n" +
                    "---------------------------------------------------------------------------\n" +
                    "review日期：${reviewDate}\n" +
                    "状态：已经修复\n" +
                    "Java类：${java.class.url.gitlab}\n" +
                    "---------------------------------------------------------------------------\n" +
                    "\n" +
                    "=============================================\n";

    /**
     * 默认preDeal模板
     */
    public static final String DEFAULT_PREDEAL_TEMPLATE =
            "a(当天工作成果)\n" +
                    "${today.achievements}\n" +
                    "\n" +
                    "b(碰到的问题和解决方案)\n" +
                    "${problems.solutions}\n" +
                    "\n" +
                    "c(明天工作计划)\n" +
                    "${tomorrow.targets}\n";
}
